birthday_api/app/controllers/birthdays_controller.rb

  def index
    @birthdays = Birthday.all
---
SELECT "birthdays".* FROM "birthdays"

  def create
    @birthday = Birthday.new(birthday_params)

    if @birthday.save
---
INSERT INTO "birthdays" ("name", "dob", "relationship", "gift", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "xiaolin 1"], ["dob", "00000"], ["relationship", "1234"], ["gift", "333"], ["created_at", "2020-04-03 19:42:43.934811"], ["updated_at", "2020-04-03 19:42:43.934811"]]

  def update
    if @birthday.update(birthday_params)
---
UPDATE "birthdays" SET "dob" = $1, "updated_at" = $2 WHERE "birthdays"."id" = $3  [["dob", "11th May 2020"], ["updated_at", "2020-04-03 15:34:09.415177"], ["id", 7]]

  def destroy
    @birthday.destroy
---
DELETE FROM "birthdays" WHERE "birthdays"."id" = $1  [["id", 7]]

    def set_birthday
      @birthday = Birthday.find(params[:id])
---
SELECT "birthdays".* FROM "birthdays" WHERE "birthdays"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]