birthday_api/app/controllers/gifts_controller.rb

  def index
    @gifts = Gift.all
---
SELECT "gifts".* FROM "gifts"

  def create
    @gift = Gift.new(gift_params)
    @gift.birthday_id = params[:birthday_id]
    if @gift.save
---
INSERT INTO "gifts" ("name", "sender", "price", "created_at", "updated_at", "birthday_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "table"], ["sender", "John"], ["price", 50], ["created_at", "2020-04-03 15:57:43.846004"], ["updated_at", "2020-04-03 15:57:43.846004"], ["birthday_id", 1]]

  def update
    if @gift.update(gift_params)
---
UPDATE "gifts" SET "name" = $1, "price" = $2, "updated_at" = $3 WHERE "gifts"."id" = $4  [["name", "Beans"], ["price", 45], ["updated_at", "2020-04-03 21:09:52.487459"], ["id", 6]]

  def destroy
    @gift.destroy
---
DELETE FROM "gifts" WHERE "gifts"."id" = $1  [["id", 5]]

    def set_gift
      @gift = Gift.find(params[:id])
---
SELECT "gifts".* FROM "gifts" WHERE "gifts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]